"""
++++++++++++++++++++++++++++++++++++++++++++++++
Словари в Python (dict)
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1.Создайте словарь, в котором хранятся названия фруктов и их цены за 1 кг.
Добавьте в словарь еще один фрукт и выведите итоговый словарь.
===============================================
2. Дан словарь с оценками студентов:
grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
Выведите имена студентов, у которых оценка не ниже 4.
===============================================
3. Создайте словарь, содержащий название стран в качестве ключей и их столицы в качестве значений.
Пользователь вводит название страны.
Выведите столицу этой страны (если страна отсутствует в словаре, выведите "Страна не найдена").
===============================================
4. Дан список студентов и их курсов:
students = [
    ("Анна", "Python"),
    ("Борис", "Java"),
    ("Виктор", "Python"),
    ("Галина", "C++"),
    ("Дмитрий", "Python")
]
Создайте словарь, в котором ключами будут названия курсов, а значениями — списки студентов, которые изучают этот курс.
===============================================
5. Создайте словарь, содержащий оценки студентов:
Используя метод pop(), удалите студента с самой низкой оценкой и выведите обновленный словарь.
===============================================
6. Дан список студентов:
students = ["Анна", "Борис", "Виктор", "Галина"]
Преобразуйте этот список в словарь, заполнив значения всех студентов None. Затем обновите словарь указав в значение возраст студентов.
===============================================
7. Дан словарь с курсами валют:
exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
Пользователь вводит валюту (USD, EUR или GBP).
Если валюта есть в словаре, выведите ее курс, иначе выведите "Неизвестная валюта". Если валюта не известна, то
добавьте новую валюты со значением None
8. Создайте два словаря:
dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
Объедините их с помощью update().
+++++++++++++++++++++++++++++++++++++++++++++++
Кортежи в Python
+++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Создайте кортеж из пяти элементов (разных типов данных).
Выведите на экран второй элемент и последний элемент этого кортежа.
===============================================
2. Дан кортеж чисел:
nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
Выведите количество вхождений числа 4 в этом кортеже.
Найдите индекс первого вхождения числа 7.
===============================================
3. Преобразуйте следующий список в кортеж:
lst = ["Python", "Java", "C++", "JavaScript"]
После преобразования проверьте, присутствует ли в кортеже элемент "C++".
===============================================
4. Создайте кортеж с числами от 1 до 10.
Используя срезы, выведите:
Первые три элемента.
Последние три элемента.
Все элементы с шагом 2.
===============================================
5. Создайте кортеж, содержащий вложенные список и словарь.
Попробуйте изменить список внутри кортежа, добавив в него новый элемент.
"""